{
  "header": "\n<table><title><ioName></title><genText>\n<genText></table>\nPlease enter an action: ",
  "table_titled": "<table><title><genText></title><genText></table>",
  "table_untitled": "<table><genText></table>",
  "menu_table": "<table><title><genText></title><genText>\n<genText></table>\n<genText>",
  "stats_table": "Skill  : <genText>\nStamina: <genText>\nLuck   : <genText>",
  "enemy_stats_table": "<genText>\nSkill  : <genText>\nStamina: <genText>",
  "continue": "-- Press [Enter] to Continue --",
  "invalid_input": "I'm sorry, I can't understand what you were trying to do.",
  "invalid_exit": "You can't go that way.",
  "exit_blocked": "The way is blocked by <tioName>.",
  "attack_no_one": "Settle down, there's no one here to attack.",
  "no_escape": "You can't escape.  You'll have to fight your way out.",
  "open_no_door": "There are no doors here to open!",
  "open_which_door": "Which door do you want to open?",
  "open_locked_door": "It's locked.  Try to USE a key or SMASH it open.",
  "smash_no_door": "There are no doors here to smash!",
  "smash_which_door": "Which door do you want to smash?",
  "smash_door_12_success": "The door bursts open and you fall headlong into a room. But your heart jumps as you realize you are not landing on the floor, but plunging down a pit of some kind! Lose 1 STAMINA.",
  "smash_door_12_failure": "You rub your bruised shoulder and stare at the intact, still-locked door.",
  "climb_139_out": "You climb out of the pit.",
  "climb_139_in": "You climb into the pit. Yep, just as you remember it - an empty hole. You climb back out.",
  "climb_no_where": "Climb what?  I don't see anything.",
  "choice": "Please enter your choice: ",
  "BACKGROUND": "Wandering across the Pagan Plain to the west of the Moonstone Hills, you meet an old man pushing a laden handcart. You call out to him to stop and he does so with a resigned expression on his face. \"I've nothing in my cart that you would want\", the old man says dejectedly. Walking up to him, you reassure him that you have no desire to rob him, you simply wish to exchange news. You tell him that you are an adventurer roaming the land in search of dangerous quests. The old man smiles, saying, \"Then perhaps you ought to visit the village where I live. It's a place where we could use the likes of you. We are worried by strange tales of happenings to the east, around Firetop Mountain, which towers above its tiny brethren of Moonstone Hills, and is a good two days' walk from our village. Vile creatures have been seen entering the mountainside through a cave. The mountain is ruled from its depths by a might sorceror - a Warlock! When our crops started to fail, we knew it must be because of the evil coming from Firetop Mountain. We sent our bravest men into the mountain to root out the Warlock, but none of them have returned save one, and he was but a shadow of the man he was before he set out. He could only mumble a few words about his terrible experience. Now we live without hope, waiting for doom to descend upon us like the inevitable rain. Stranger, if it's adventure you seek, you will find none more dangerous than within the tunnels of Firetop Mountain. We have no money to pay you, but it is said that the Warlock has great riches locked away in a magnificent chest inside the mountain.\"\n\tYou tell the old man the the challenge interests you and that you will go with him to his village to find out more about this infamous Warlock of Firetop Mountain.\n\tA few hours later you arrive at the small village of Anvil and are greeted by an anxious group of locals and peasant farmers. They become very excited as the old man tells them that you are going to try to defeat the Warlock. They crowd around you, each eager to give you advice and warnings about the dangerous quest ahead. They tell you many facts about the mysterious Warlock's sanctuary, but you feel unsure about the truths of any of them. There does, however, seem to be some truth in the rumour that the Warlock's treasure is stored in a magnificent chest with two locks, and the keys to these locks are guarded by various creatures within the tunnels. Other rumours are perhaps mere speculation. Some describe the Warlock as old, others as young. Some say his power comes from an enchanted deck of cards, others say it comes from the black silk gloves that he wears. A farmer insists that he saw warty-faced Goblins guarding the entrance to the mountain. He brags that his friend has killed one who was stupid and fell into a trap baited with food and drink. In a more serious tone, the head villager advises you to keep a good map of your wanderings, for without one you will end up hopelessly lost inside the mountain as those before you have done. He also tells you that the unfortunate villager who returned told of fearsome creatures towards the inner chambers, which can be reached by crossing an underground river. He tells you to beware the stange ferryman who charges Gold Pieces for his services.\n\tThe next day, you try to concentrate on the coming journey, and images of the Warlock and all his evil servants keep rushing through your mind. You practise your swordplay and eat as much as you are able to build up your strength.\n\tWhen you finally prepare to leave, the whole village turns out to wish you a safe journey. Tears come to the eyes of the many of the women, young and old alike. You can't help wondering whether they are tears of sorrow shed by eyes which might never see you alive again...",
  "START": "\tAt last your two-day hike is over. You unsheathe your sword, lay it on the ground and sigh with relief as you lower yourself down on to the mossy rocks to sit for a moment's rest. You stretch, rub your eyes and finally look up at Firetop Mountain.\n\tThe very mountain itself looks menacing. The steep face in front of you looks to have been savaged by the claws of some gargantuan beast. Sharp rocky crags jut out at unnatural angles. At the top of the mountain you can see the eerie red colouring - probably some strange vegetation - which has given the mountain its name. Perhaps no one will ever know exactly what grows up there, as climbing the peak must surely be impossible.\n\tYour quest lies ahead of you. Across the clearing is a dark cave entrance. You pick up your sword, get to your feet and consider what dangers may lie ahead of you. But with determination, you thrust the sword home into its scabbard and approach the cave.",
  "1": "You peer into the gloom to see dark, slimy walls with pools of water on the stone floor in front of you. The air is cold and dank. You light your lantern and step warily into the blackness. Cobwebs brush your face and you hear the scurrying of tiny feet: rats, most likely. You set off into the cave. After a few yards you arrive at a junction. Passages lead West and East.",
  "1_EAST": "You take the eastern passage.",
  "1_WEST": "You follow the passage leading west.",
  "1_SOUTH": "You would abandon your adventure?!  Shame.  SHAME!  I won't allow it.  Close the tab if you want to leave so bad.",
  "1_SECONDARY": "You are at a junction in a cave passage.  Passages lead further into the cave to the West and East.  There is also a passage to the South, leading both to the cave's exit and to everlasting shame for abandoning your adventure.\n",
  "12": "The passageway soon comes to an end at a locked wooden door. You listen at the door but hear nothing.\n",
  "12_SECONDARY": "You are in an east-west corridor.  There is a locked wooden door on the eastern end.\n",
  "12_TERTIARY": "You are in an east-west corridor.  A wooden door on the eastern end hangs open.\n",
  "12_EAST": "You follow the passage east.",
  "12_WEST": "You follow the passage west to the junction.",
  "43": "To your left, on the west face of the passage, there is a rough-cut wooden door. You listen at the door and can hear a rasping sound which may be some sort of creature snoring.\n",
  "43_SECONDARY": "You are in a North-South passage.  There is a doorway on west face.\n",
  "43_WEST": "You enter the room.",
  "43_NORTH": "You follow the passage north.",
  "43_SOUTH": "You follow the passage south.",
  "71": "There is a right-hand turn to the north in the passage. Cautiously you approach a sentry post on the corner and, as you look in, you can see a strange Goblin-like creature in leather armour asleep at his post. You might be able to tiptoe past him.\n",
  "71_EAST": "You head east.",
  "71_NORTH": "You head north.",
  "71_SECONDARY": "You are in an L-shaped passage traveling North and East.  A Goblin-like creature snores blissfully in the corner.\n",
  "71_TERTIARY": "You are in an L-shaped passage traveling North and East.  In the corner a bloodied ORC sleeps with the dead.\n",
  "82": "The door opens to reveal a small, smelly room. In the centre of the room is a rickety wooden table on which stands a lit candle. Underneath the table is a small wooden box. Asleep on a straw mattress in the far corner of the room is a short, stocky creature with an ugly, warty face; the same sort of creature that you found asleep at the sentry post. He must be the guard for the night watch.\n",
  "82_SECONDARY": "You are in a small, smelly room. In the centre of the room is a rickety wooden table on which stands a lit candle.\n",
  "82_TERTIARY": "You are in a small, smelly room whose walls are spattered with blood and viscera. In the centre of the room is a rickety wooden table on which stands a lit candle.\n",
  "82_EAST": "You leave the room.",
  "139": "You are standing in a pit about two metres deep. The room is otherwise empty, and there is a corridor beyond a broken wooden door to the west.",
  "139_SECONDARY": "You are in an empty room whose only feature is a small pit. Beyond a broken wooden door a corridor leads west.",
  "139_WEST": "You step out of the room into the corridor.",
  "orc_sentry_aggression": "You step with a crunch on some loose ground. The ORC's eyes flick open and he scrambles to his feet and turns to grasp at a rope which is probably the alarm bell. You must attack him quickly.",
  "orc_sentry_dying": "The ORC gurgles as it collapses. '~burz~'",
  "orc_sentry_ouch": "'~azgdrar mugh~' the orc declares.",
  "orc_sentry_ouch_medium": "The orc eyes you defiantly. '~mugh... tum brakat~'",
  "orc_sentry_ouch_strong": "The orc screams at you in desperation. '~MUGH AGDUM~'",
  "orc_sentry_search": "'~tugh gimbat~'.  The orc scans the room.",
  "orc_sentry_thief": "'~gulBIL~'",
  "orc_sentry_threat": "'~tugh damad~'",
  "orc_sentry_victory": "'~skai~', the ORC sneers.",
  "orc_sentry_2_aggression": "You smash through the unlocked door. The source of the snoring you heard awakens startled. He jumps up and rushes at you, unarmed. With your sword you should be able to defeat him, but his sharp teeth look rather vicious.",
  "orc_sentry_2_aggression_2": "The sleeping creature awakens startled. He jumps up and rushes at you, unarmed. With your sword you should be able to defeat him, but his sharp teeth look rather vicious.",
  "orc_sentry_2_aggression_3": "The ORC stares in disbelief as you saunter back into the room you ran away from.  He charges."
}